fixed_answers = {
    "unknown_answer" : [
        "Yirannn不让我和陌生人说话, 呜",
        "你还不是我的好友哦",
        "不能和陌生人说话了啦",
        "想要和我单独聊天要先加好友！",
        "有什么建议要联系Yirannn",
        "我们还不认识呢"
    ],
    "unknown_girls" : [
        "诶！小姐姐！！！",
        "小姐姐！！...Yirannn不让我和陌生人说话, 呜",
        "你还不是我的好友哦",
        "不能和陌生人说话了啦",
        "姐姐想要和我单独聊天要先加好友！",
        "如果有什么建议要联系Yirannn, 诶嘿嘿",
        "我们还不认识呢, 可是....是小姐姐诶"
    ],
    "no_answer" : [
        "呜呜, 我还听不懂你说话了啦",
        "发送.help获取帮助来的",
        "我听不懂哦，但是你可以私聊教我~",
        "你到底在说什么呀?",
        "哼, 你再和我说这些奇怪的话我就不理你了!",
        "呜呜呜, 我听不懂啦~",
        "确实"
    ],
    "bad_words" : [
        "操",
        "特么",
        "傻逼",
        "你妈的",
        "滚",
        "你妈死了",
    ],
    "anti-bad_words" : [
        "不要说脏话啦~大家都是乖宝宝~",
        "你再说脏话xin就不理你了！哼！",
        "不能说脏话！",
        "脏话什么的，一点都不可爱哦",
        "呜, 不要说脏话啦 [CQ:face,id=9]"
    ],
    "custom_learned" : [
        "我已经会了哦~",
        "我知道啦我知道啦，不用再教我啦",
        "嘿嘿，这句话之前有人教过我啦"
    ],
    "custom_learn" : [
        "记住啦！",
        "你说的话我有认真听哦~",
        "诶嘿嘿, 会了会了！"
    ],
    "custom_removed" : [
        "好啦好啦，我已经忘掉啦！",
        "忘掉咯~",
        "知道啦！"
    ],
    "custom_removerr" : [
        "我好像本来就不会了啦~",
        "咦，我不记得这句话呢",
        "呜呜呜，你有和我说过这个嘛？"
    ]
}